programming/golang/the-little-go-book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-08-26 六 09:10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Note on "The little Go Book"</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Zhao WenBin">
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Note on "The little Go Book"</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org64f167c">前言</a></li>
<li><a href="#org8f60ca6">代码结构</a></li>
<li><a href="#org18ac845">Basic</a></li>
<li><a href="#orgd5cc6e7">Structure</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org64f167c" class="outline-2">
<h2 id="org64f167c">前言</h2>
<div class="outline-text-2" id="text-org64f167c">
</div><div id="outline-container-org3861466" class="outline-3">
<h3 id="org3861466">为什么不愿意学习新的语言</h3>
<div class="outline-text-3" id="text-org3861466">
<ol class="org-ol">
<li>语言相对基础，任何变动都会对上层产生影响</li>
<li>语言细节多，学习涉及方方面面，付出与收效比例不相当</li>
</ol>
</div>
</div>

<div id="outline-container-orgba4f4cc" class="outline-3">
<h3 id="orgba4f4cc">为什么要学习 go</h3>
<div class="outline-text-3" id="text-orgba4f4cc">
<ul class="org-ul">
<li>语法和标准库相对简单</li>
<li>社区活跃</li>
<li>其它
<ul class="org-ul">
<li>静态语言</li>
<li>适合于系统级或大型应用级别的开发</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8f60ca6" class="outline-2">
<h2 id="org8f60ca6">代码结构</h2>
<div class="outline-text-2" id="text-org8f60ca6">
<ul class="org-ul">
<li><code>${GOPATH}</code> 环境变量定义 workspace</li>
<li>workspace 下保存目录代码和生成结果，如 <code>src</code>, <code>bin</code>, <code>pkg</code> 等</li>
</ul>
</div>
</div>

<div id="outline-container-org18ac845" class="outline-2">
<h2 id="org18ac845">Basic</h2>
<div class="outline-text-2" id="text-org18ac845">
</div><div id="outline-container-orgae40f68" class="outline-3">
<h3 id="orgae40f68">特点</h3>
<div class="outline-text-3" id="text-orgae40f68">
</div><div id="outline-container-org9623f3f" class="outline-4">
<h4 id="org9623f3f">编译型</h4>
<div class="outline-text-4" id="text-org9623f3f">
<ul class="org-ul">
<li>编译速度快，能更快迭代</li>
<li>运行速度相对解释型快</li>
<li>无依赖</li>
</ul>
</div>
</div>

<div id="outline-container-org159c8f3" class="outline-4">
<h4 id="org159c8f3">静态类型</h4>
<div class="outline-text-4" id="text-org159c8f3">
<ul class="org-ul">
<li>可以通过手动指定类型，或由编译器推导类型</li>
<li>编译时可以检查出很多错误，增强可靠性</li>
</ul>
</div>
</div>

<div id="outline-container-org9db654c" class="outline-4">
<h4 id="org9db654c">类 C 语法</h4>
<div class="outline-text-4" id="text-org9db654c">
<ul class="org-ul">
<li>去掉了 semi-colon terminated</li>
<li>去掉了 parenthese around conditions</li>
<li>在表示优先级时可以使用括号</li>
</ul>
</div>
</div>

<div id="outline-container-org801d798" class="outline-4">
<h4 id="org801d798">GC</h4>
<div class="outline-text-4" id="text-org801d798">
<ul class="org-ul">
<li>keep track of values</li>
<li>and free them when they're no longer used.</li>
</ul>
</div>
</div>
</div>













<div id="outline-container-orgd114c2d" class="outline-3">
<h3 id="orgd114c2d">running</h3>
<div class="outline-text-3" id="text-orgd114c2d">
<ul class="org-ul">
<li>使用 go run 来执行</li>
<li>使用 go build 来编译，生成可执行文件</li>
<li>入口是 main 包的 main 函数</li>
<li>非 main 包不能执行</li>
<li>非 main 包能 build，但不会生成库文件</li>
<li>build 生成的可执行文件与源码同名</li>
</ul>
</div>
</div>




<div id="outline-container-org06f5258" class="outline-3">
<h3 id="org06f5258">Import</h3>
<div class="outline-text-3" id="text-org06f5258">
<ul class="org-ul">
<li>有一些默认的函数不需要导入，如 <code>len</code>, <code>cap</code>, <code>println</code></li>
<li><code>import</code> 用于导入指定字符串对应的包，可以一次导入多个</li>
<li>不允许未被使用的包的导入（会降低编译速度）</li>
<li>使用 godoc 来查看包及函数、类型的使用手册</li>
</ul>
</div>
</div>

<div id="outline-container-orgb4baf54" class="outline-3">
<h3 id="orgb4baf54">变量与申明</h3>
<div class="outline-text-3" id="text-orgb4baf54">
<ul class="org-ul">
<li>使用 <code>var</code> 定义，类型在后</li>
<li>或者使用 <code>:=</code> 来定义局部变量，类型由值推导而来</li>
<li>默认会赋予 zero value</li>
<li>可以多变量赋值</li>
<li>不允许的未被使用的变量</li>
</ul>
</div>

<div id="outline-container-org4440166" class="outline-4">
<h4 id="org4440166">注意</h4>
<div class="outline-text-4" id="text-org4440166">
<ul class="org-ul">
<li><code>:=</code> 会阻止重复定义</li>
<li>但只要左值有一个是新的变量， <code>:=</code> 将允许赋值</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org781531c" class="outline-3">
<h3 id="org781531c">函数声明</h3>
<div class="outline-text-3" id="text-org781531c">
<ul class="org-ul">
<li>可以返回多个值</li>
<li>使用 blank identifier ( "_" ) 来忽略赋值</li>
<li>相同参数类型时，可以简写类型到最后（ shorter syntax ）</li>
<li>Named return values</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgd5cc6e7" class="outline-2">
<h2 id="orgd5cc6e7">Structure</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zhao WenBin</p>
<p class="date">Created: 2017-08-26 六 09:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
